# Анализ и прогнозирование заказов такси в Чикаго

## Обзор проекта

В наших руках находятся записи более чем по 10 млн. поездок на такси, совершенных в Чикаго. Целью является создание модели, способной прогнозировать количество заказов такси на следующий час для каждого района города. Для решения этой задачи мы применяем технологии, такие как PySpark, и развертываем решение на локальном кластере, основанном на Docker контейнерах🐳.

## Цели и задачи:

- **Развертывание**: Настроить PySpark на локальном кластере из Docker контейнеров🐳.
- **Исследование данных (EDA)**: Анализировать основные характеристики и распределения данных.
- **Предобработка**: Агрегация и очистка данных для обучения модели.
- **Генерация признаков**: Создание и отбор релевантных атрибутов для повышения качества модели.
- **Моделирование**: Построение и тестирование различных ML-моделей для достижения наилучшего прогноза.

### Метрика:

Ценность предсказания определяется на основе того, насколько это поможет компаниям оптимизировать свои операции. Следовательно, мы применяем метрику MAE (Среднее абсолютное отклонение) для измерения точности прогноза.

## Библиотеки и инструменты:

- PySpark
- Pandas
- NumPy
- Matplotlib
- Statsmodels
- Folium

## Исходные данные:

Данные для анализа и моделирования были взяты из Чикагского информационного портала за 2022 и 2023 годы.

## Области применения прогнозирования заказов такси:

- **Транспортные компании**: Оптимизация флота и ресурсов, удовлетворяя потребности пассажиров.
- **Городская инфраструктура**: Определение пиковой активности и планирование транспортных средств.
- **Туризм**: Адаптация к потоку туристов в основных точках интереса.
- **Доставка еды**: Оптимизация логистики доставки на основе прогнозов.
- **Организация мероприятий**: Планирование транспортных потребностей после крупных событий.
- **Реклама**: Анализ потребительского поведения для планирования рекламных кампаний.
- **Общественная безопасность**: Планирование патрулирования на основе прогнозов активности.
- **Городское планирование**: Оптимизация городской транспортной сети и снижение пробок.

Прогнозирование заказов такси позволяет предоставить ценную информацию, которая может быть использована в различных секторах для оптимизации ресурсов и улучшения обслуживания клиентов.

